# St7SetLoadCaseGravityDir

Sets the direction of the gravity vector for the specified load case.

long St7SetLoadCaseGravityDir(long uID, long CaseNum, long GravDir)

Input Parameters

uID

Strand7 model file ID.

CaseNum

Load case number.

GravDir

Gravity direction specified in the global XYZ system; one of 1, 2 or 3.